__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 24, 24, 3)]  0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 22, 22, 28)   784         input_1[0][0]
__________________________________________________________________________________________________
prelu1 (PReLU)                  (None, 22, 22, 28)   28          conv1[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 11, 11, 28)   0           prelu1[0][0]
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 9, 9, 48)     12144       max_pooling2d[0][0]
__________________________________________________________________________________________________
prelu2 (PReLU)                  (None, 9, 9, 48)     48          conv2[0][0]
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 5, 5, 48)     0           prelu2[0][0]
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 3, 3, 64)     27712       max_pooling2d_1[0][0]
__________________________________________________________________________________________________
prelu3 (PReLU)                  (None, 3, 3, 64)     64          conv3[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 576)          0           prelu3[0][0]
__________________________________________________________________________________________________
dense1 (Dense)                  (None, 128)          73856       flatten[0][0]
__________________________________________________________________________________________________
prelu4 (PReLU)                  (None, 128)          1           dense1[0][0]
__________________________________________________________________________________________________
classifier1 (Dense)             (None, 2)            258         prelu4[0][0]
__________________________________________________________________________________________________
bbox1 (Dense)                   (None, 4)            516         prelu4[0][0]
==================================================================================================
Total params: 115,411
Trainable params: 115,411
Non-trainable params: 0
__________________________________________________________________________________________________