__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 12, 12, 3)]  0
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 10, 10, 8)    224         input_1[0][0]
__________________________________________________________________________________________________
prelu1 (PReLU)                  (None, 10, 10, 8)    8           conv1[0][0]
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 5, 5, 8)      0           prelu1[0][0]
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 3, 3, 16)     1168        max_pooling2d[0][0]
__________________________________________________________________________________________________
prelu2 (PReLU)                  (None, 3, 3, 16)     16          conv2[0][0]
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 1, 1, 32)     4640        prelu2[0][0]
__________________________________________________________________________________________________
prelu3 (PReLU)                  (None, 1, 1, 32)     32          conv3[0][0]
__________________________________________________________________________________________________
classifier1 (Conv2D)            (None, 1, 1, 2)      66          prelu3[0][0]
__________________________________________________________________________________________________
bbox1 (Conv2D)                  (None, 1, 1, 4)      132         prelu3[0][0]
__________________________________________________________________________________________________
reshape (Reshape)               (None, 2)            0           classifier1[0][0]
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 4)            0           bbox1[0][0]
==================================================================================================
Total params: 6,286
Trainable params: 6,286
Non-trainable params: 0
__________________________________________________________________________________________________
None

Process finished with exit code 0
